from math import nan

import pandas as pd

from config import DATA_DIR
from src.reports import spending_by_category

all_operations = pd.read_excel(DATA_DIR, na_filter=True)

def test_spending_by_category():
    result = spending_by_category(all_operations, "Цветы", "2019-12-10 23:30:12")
    assert result == [{'Дата операции': '29.11.2019', 'Дата платежа': '01.12.2019', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -360.0, 'Валюта операции': 'RUB', 'Сумма платежа': -360.0, 'Валюта платежа': 'RUB', 'Кэшбэк': nan, 'Категория': 'Цветы', 'MCC': 5992.0, 'Описание': 'Cvety Opt Roznica', 'Бонусы (включая кэшбэк)': 7, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 360.0}, {'Дата операции': '16.09.2019', 'Дата платежа': '19.09.2019', 'Номер карты': '*7197', 'Статус': 'OK', 'Сумма операции': -650.0, 'Валюта операции': 'RUB', 'Сумма платежа': -650.0, 'Валюта платежа': 'RUB', 'Кэшбэк': nan, 'Категория': 'Цветы', 'MCC': 5992.0, 'Описание': 'Cvety Opt Roznica', 'Бонусы (включая кэшбэк)': 13, 'Округление на инвесткопилку': 0, 'Сумма операции с округлением': 650.0}]
